data_generation/simulation_results/openfoam/case_21/constant/simParams
nIter 2000;
hComponent0 1271.620848045977;
hComponent1 1354.7667934729682;
hComponent2 631.0609674953361;
hComponent3 1448.6944553114297;
hComponent4 625.2982412963993;kComponent0 29.245485026697814;
kComponent1 99.11395733885628;
kComponent2 23.750482264835156;
kComponent3 31.035975298835375;
kComponent4 15.429615351357139;
tAmbient 300;
Ux 0.8872585176695675;
kPCB 0.5494481342807722;